; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph1 - mode
	thermograph2 - mode
	image0 - mode
	Star0 - direction
	Star2 - direction
	GroundStation1 - direction
	Star3 - direction
	Planet4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 149)
	(= (data Star3 thermograph1) 275)
	(= (data Planet4 thermograph1) 156)
	(= (data Star5 thermograph1) 176)
	(= (data Phenomenon6 thermograph1) 149)
	(= (data Phenomenon7 thermograph1) 123)
	(= (data Planet8 thermograph1) 82)
	(= (data Phenomenon9 thermograph1) 201)
	(= (data Star10 thermograph1) 131)
	(= (data Phenomenon11 thermograph1) 91)
	(= (data Star3 thermograph2) 85)
	(= (data Planet4 thermograph2) 278)
	(= (data Star5 thermograph2) 289)
	(= (data Phenomenon6 thermograph2) 34)
	(= (data Phenomenon7 thermograph2) 72)
	(= (data Planet8 thermograph2) 106)
	(= (data Phenomenon9 thermograph2) 192)
	(= (data Star10 thermograph2) 267)
	(= (data Phenomenon11 thermograph2) 39)
	(= (data Star3 image0) 172)
	(= (data Planet4 image0) 130)
	(= (data Star5 image0) 38)
	(= (data Phenomenon6 image0) 93)
	(= (data Phenomenon7 image0) 66)
	(= (data Planet8 image0) 50)
	(= (data Phenomenon9 image0) 257)
	(= (data Star10 image0) 5)
	(= (data Phenomenon11 image0) 188)
	(= (slew_time Star2 Star0) 8.338)
	(= (slew_time Star0 Star2) 8.338)
	(= (slew_time Star2 GroundStation1) 10.33)
	(= (slew_time GroundStation1 Star2) 10.33)
	(= (slew_time GroundStation1 Star0) 70.6)
	(= (slew_time Star0 GroundStation1) 70.6)
	(= (slew_time Star3 Star0) 29.85)
	(= (slew_time Star0 Star3) 29.85)
	(= (slew_time Star3 GroundStation1) 25.85)
	(= (slew_time GroundStation1 Star3) 25.85)
	(= (slew_time Star3 Star2) 33.93)
	(= (slew_time Star2 Star3) 33.93)
	(= (slew_time Planet4 Star0) 34.18)
	(= (slew_time Star0 Planet4) 34.18)
	(= (slew_time Planet4 GroundStation1) 83.09)
	(= (slew_time GroundStation1 Planet4) 83.09)
	(= (slew_time Planet4 Star2) 8.543)
	(= (slew_time Star2 Planet4) 8.543)
	(= (slew_time Planet4 Star3) 20.47)
	(= (slew_time Star3 Planet4) 20.47)
	(= (slew_time Star5 Star0) 1.752)
	(= (slew_time Star0 Star5) 1.752)
	(= (slew_time Star5 GroundStation1) 57.23)
	(= (slew_time GroundStation1 Star5) 57.23)
	(= (slew_time Star5 Star2) 35.45)
	(= (slew_time Star2 Star5) 35.45)
	(= (slew_time Star5 Star3) 4.294)
	(= (slew_time Star3 Star5) 4.294)
	(= (slew_time Star5 Planet4) 25.72)
	(= (slew_time Planet4 Star5) 25.72)
	(= (slew_time Phenomenon6 Star0) 15.67)
	(= (slew_time Star0 Phenomenon6) 15.67)
	(= (slew_time Phenomenon6 GroundStation1) 54.41)
	(= (slew_time GroundStation1 Phenomenon6) 54.41)
	(= (slew_time Phenomenon6 Star2) 21.76)
	(= (slew_time Star2 Phenomenon6) 21.76)
	(= (slew_time Phenomenon6 Star3) 21.13)
	(= (slew_time Star3 Phenomenon6) 21.13)
	(= (slew_time Phenomenon6 Planet4) 13.61)
	(= (slew_time Planet4 Phenomenon6) 13.61)
	(= (slew_time Phenomenon6 Star5) 45.41)
	(= (slew_time Star5 Phenomenon6) 45.41)
	(= (slew_time Phenomenon7 Star0) 49.95)
	(= (slew_time Star0 Phenomenon7) 49.95)
	(= (slew_time Phenomenon7 GroundStation1) 39.95)
	(= (slew_time GroundStation1 Phenomenon7) 39.95)
	(= (slew_time Phenomenon7 Star2) 27.56)
	(= (slew_time Star2 Phenomenon7) 27.56)
	(= (slew_time Phenomenon7 Star3) 33.74)
	(= (slew_time Star3 Phenomenon7) 33.74)
	(= (slew_time Phenomenon7 Planet4) 12.44)
	(= (slew_time Planet4 Phenomenon7) 12.44)
	(= (slew_time Phenomenon7 Star5) 4.019)
	(= (slew_time Star5 Phenomenon7) 4.019)
	(= (slew_time Phenomenon7 Phenomenon6) 64.08)
	(= (slew_time Phenomenon6 Phenomenon7) 64.08)
	(= (slew_time Planet8 Star0) 30.09)
	(= (slew_time Star0 Planet8) 30.09)
	(= (slew_time Planet8 GroundStation1) 0.7266)
	(= (slew_time GroundStation1 Planet8) 0.7266)
	(= (slew_time Planet8 Star2) 10.15)
	(= (slew_time Star2 Planet8) 10.15)
	(= (slew_time Planet8 Star3) 52.85)
	(= (slew_time Star3 Planet8) 52.85)
	(= (slew_time Planet8 Planet4) 55.57)
	(= (slew_time Planet4 Planet8) 55.57)
	(= (slew_time Planet8 Star5) 41.62)
	(= (slew_time Star5 Planet8) 41.62)
	(= (slew_time Planet8 Phenomenon6) 36.64)
	(= (slew_time Phenomenon6 Planet8) 36.64)
	(= (slew_time Planet8 Phenomenon7) 40.46)
	(= (slew_time Phenomenon7 Planet8) 40.46)
	(= (slew_time Phenomenon9 Star0) 30.57)
	(= (slew_time Star0 Phenomenon9) 30.57)
	(= (slew_time Phenomenon9 GroundStation1) 0.06336)
	(= (slew_time GroundStation1 Phenomenon9) 0.06336)
	(= (slew_time Phenomenon9 Star2) 28.02)
	(= (slew_time Star2 Phenomenon9) 28.02)
	(= (slew_time Phenomenon9 Star3) 33.04)
	(= (slew_time Star3 Phenomenon9) 33.04)
	(= (slew_time Phenomenon9 Planet4) 51.11)
	(= (slew_time Planet4 Phenomenon9) 51.11)
	(= (slew_time Phenomenon9 Star5) 21.54)
	(= (slew_time Star5 Phenomenon9) 21.54)
	(= (slew_time Phenomenon9 Phenomenon6) 48.6)
	(= (slew_time Phenomenon6 Phenomenon9) 48.6)
	(= (slew_time Phenomenon9 Phenomenon7) 78.29)
	(= (slew_time Phenomenon7 Phenomenon9) 78.29)
	(= (slew_time Phenomenon9 Planet8) 27.98)
	(= (slew_time Planet8 Phenomenon9) 27.98)
	(= (slew_time Star10 Star0) 12)
	(= (slew_time Star0 Star10) 12)
	(= (slew_time Star10 GroundStation1) 13.29)
	(= (slew_time GroundStation1 Star10) 13.29)
	(= (slew_time Star10 Star2) 76.63)
	(= (slew_time Star2 Star10) 76.63)
	(= (slew_time Star10 Star3) 31.89)
	(= (slew_time Star3 Star10) 31.89)
	(= (slew_time Star10 Planet4) 26.46)
	(= (slew_time Planet4 Star10) 26.46)
	(= (slew_time Star10 Star5) 47.97)
	(= (slew_time Star5 Star10) 47.97)
	(= (slew_time Star10 Phenomenon6) 48.92)
	(= (slew_time Phenomenon6 Star10) 48.92)
	(= (slew_time Star10 Phenomenon7) 41.23)
	(= (slew_time Phenomenon7 Star10) 41.23)
	(= (slew_time Star10 Planet8) 95.84)
	(= (slew_time Planet8 Star10) 95.84)
	(= (slew_time Star10 Phenomenon9) 35.96)
	(= (slew_time Phenomenon9 Star10) 35.96)
	(= (slew_time Phenomenon11 Star0) 57.09)
	(= (slew_time Star0 Phenomenon11) 57.09)
	(= (slew_time Phenomenon11 GroundStation1) 5.775)
	(= (slew_time GroundStation1 Phenomenon11) 5.775)
	(= (slew_time Phenomenon11 Star2) 14.74)
	(= (slew_time Star2 Phenomenon11) 14.74)
	(= (slew_time Phenomenon11 Star3) 26.63)
	(= (slew_time Star3 Phenomenon11) 26.63)
	(= (slew_time Phenomenon11 Planet4) 32.83)
	(= (slew_time Planet4 Phenomenon11) 32.83)
	(= (slew_time Phenomenon11 Star5) 81.52)
	(= (slew_time Star5 Phenomenon11) 81.52)
	(= (slew_time Phenomenon11 Phenomenon6) 79.6)
	(= (slew_time Phenomenon6 Phenomenon11) 79.6)
	(= (slew_time Phenomenon11 Phenomenon7) 56.78)
	(= (slew_time Phenomenon7 Phenomenon11) 56.78)
	(= (slew_time Phenomenon11 Planet8) 49.35)
	(= (slew_time Planet8 Phenomenon11) 49.35)
	(= (slew_time Phenomenon11 Phenomenon9) 53.97)
	(= (slew_time Phenomenon9 Phenomenon11) 53.97)
	(= (slew_time Phenomenon11 Star10) 13.36)
	(= (slew_time Star10 Phenomenon11) 13.36)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star3 thermograph2)
	(have_image Planet4 image0)
	(have_image Star5 image0)
	(have_image Phenomenon6 thermograph2)
	(have_image Phenomenon7 thermograph1)
	(have_image Phenomenon9 image0)
	(have_image Star10 image0)
	(have_image Phenomenon11 thermograph2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 phenomenon9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 149 to 118.43, (fuel-used) from 0 to 30.57
   goals met: 0 of 8
2. (turn_to satellite0 groundstation1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 118.43 to 118.367, (fuel-used) from 30.57 to 30.6334
   goals met: 0 of 8
3. (turn_to satellite0 phenomenon9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 118.367 to 118.303, (fuel-used) from 30.6334 to 30.6967
   goals met: 0 of 8
4. (turn_to satellite0 groundstation1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 118.303 to 118.24, (fuel-used) from 30.6967 to 30.7601
   goals met: 0 of 8
5. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
6. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 8
7. (turn_to satellite0 phenomenon9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 118.24 to 118.177, (fuel-used) from 30.7601 to 30.8234
   goals met: 0 of 8
8. (take_image satellite0 phenomenon9 instrument0 image0)
   added: (have_image phenomenon9 image0)
   changed: (data_capacity satellite0) from 1000 to 743, (data-stored) from 0 to 257
   goals met: 1 of 8
9. (turn_to satellite0 groundstation1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 118.177 to 118.113, (fuel-used) from 30.8234 to 30.8868
   goals met: 1 of 8
10. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 1 of 8
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 8
12. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 1 of 8
13. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 8
14. (switch_on instrument0 satellite0)
   deleted: (calibrated instrument0) (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
15. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 1 of 8
16. (turn_to satellite0 star2 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 118.113 to 107.783, (fuel-used) from 30.8868 to 41.2168
   goals met: 1 of 8
17. (turn_to satellite0 star0 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 107.783 to 99.4452, (fuel-used) from 41.2168 to 49.5548
   goals met: 1 of 8
18. (turn_to satellite0 star5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 99.4452 to 97.6932, (fuel-used) from 49.5548 to 51.3068
   goals met: 1 of 8
19. (take_image satellite0 star5 instrument0 image0)
   added: (have_image star5 image0)
   changed: (data_capacity satellite0) from 743 to 705, (data-stored) from 257 to 295
   goals met: 2 of 8
20. (turn_to satellite0 phenomenon7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon7)
   changed: (fuel satellite0) from 97.6932 to 93.6742, (fuel-used) from 51.3068 to 55.3258
   goals met: 2 of 8
21. (take_image satellite0 phenomenon7 instrument0 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   changed: (data_capacity satellite0) from 705 to 582, (data-stored) from 295 to 418
   goals met: 3 of 8
22. (turn_to satellite0 star5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 93.6742 to 89.6552, (fuel-used) from 55.3258 to 59.3448
   goals met: 3 of 8
23. (turn_to satellite0 star0 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 89.6552 to 87.9032, (fuel-used) from 59.3448 to 61.0968
   goals met: 3 of 8
24. (turn_to satellite0 star10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 87.9032 to 75.9032, (fuel-used) from 61.0968 to 73.0968
   goals met: 3 of 8
25. (take_image satellite0 star10 instrument0 image0)
   added: (have_image star10 image0)
   changed: (data_capacity satellite0) from 582 to 577, (data-stored) from 418 to 423
   goals met: 4 of 8
26. (turn_to satellite0 phenomenon11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon11)
   changed: (fuel satellite0) from 75.9032 to 62.5432, (fuel-used) from 73.0968 to 86.4568
   goals met: 4 of 8
27. (take_image satellite0 phenomenon11 instrument0 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   changed: (data_capacity satellite0) from 577 to 538, (data-stored) from 423 to 462
   goals met: 5 of 8
28. (turn_to satellite0 star3 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 62.5432 to 35.9132, (fuel-used) from 86.4568 to 113.087
   goals met: 5 of 8
29. (take_image satellite0 star3 instrument0 thermograph2)
   added: (have_image star3 thermograph2)
   changed: (data_capacity satellite0) from 538 to 453, (data-stored) from 462 to 547
   goals met: 6 of 8
30. (turn_to satellite0 planet4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 35.9132 to 15.4432, (fuel-used) from 113.087 to 133.557
   goals met: 6 of 8
31. (take_image satellite0 planet4 instrument0 image0)
   added: (have_image planet4 image0)
   changed: (data_capacity satellite0) from 453 to 323, (data-stored) from 547 to 677
   goals met: 7 of 8
32. (turn_to satellite0 phenomenon6 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 phenomenon6)
   changed: (fuel satellite0) from 15.4432 to 1.8332, (fuel-used) from 133.557 to 147.167
   goals met: 7 of 8
33. (take_image satellite0 phenomenon6 instrument0 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   changed: (data_capacity satellite0) from 323 to 289, (data-stored) from 677 to 711
   goals met: 8 of 8
